import kotlin.math.abs

var inLimit = 0 // Объявим переменную вне функции, чтобы иметь к ней доступ везде.

fun personInStore(){ // Функция, которая будет печатать объявление и выполнять ряд операций.
    println("Уважаемые посетители!\n90 посетителей - максимум для нашего магазина.") // Объявление на входе.
    println("Укажите количество пользователей в супермаркете:") // Запрашиваем количество посетителей.

    val currentPerson = readLine()?.toInt() // Считываем данные с клавиатуры и сразу переводим в Int,
                                                 // потому что по умолчанию без указания типа считывается String,
                                                 // а нам нужно число.
                                                 // ? защищает от нулевого значения.
    val maximumPerson = 90 // Столько посетителей может находиться в магазине одновременно.
    inLimit = maximumPerson - currentPerson!! // Запишем разницу между максимумом и текущим количеством людей в магазине.
}


fun main() { // Создаём главную функцию.

    personInStore() // Вызываем функцию выше.

    if (inLimit >= 0){ // Если разница 0 или положительна, то всё ок.
        println("В магазине находится допустимое количество посетителей")
    } else{ // В противном случае количество посетителей превышено.
        println("Допустимое количество посетителей в магазине превышено на ${abs(inLimit)} посетителей.")
    } // abs здесь - это число Int по модулю, чтобы не получить отрицательного значения.
}